SIGNS = {(3, range(21, 32)): "Овен", (4, range(1, 21)): "Овен",
         (4, range(21, 31)): "Телец", (5, range(1, 21)): "Телец",
         (5, range(21, 32)): "Близнаци", (6, range(1, 21)): "Близнаци",
         (6, range(21, 31)): "Рак", (7, range(1, 22)): "Рак",
         (7, range(22, 32)): "Лъв", (8, range(1, 23)): "Лъв",
         (8, range(23, 32)): "Дева", (9, range(1, 23)): "Дева",
         (9, range(23, 31)): "Везни", (10, range(1, 23)): "Везни",
         (10, range(23, 32)): "Скорпион", (11, range(1, 22)): "Скорпион",
         (11, range(22, 31)): "Стрелец", (12, range(1, 22)): "Стрелец",
         (12, range(22, 32)): "Козирог", (1, range(1, 20)): "Козирог",
         (1, range(20, 32)): "Водолей", (2, range(1, 19)): "Водолей",
         (2, range(19, 30)): "Риби", (3, range(1, 21)): "Риби"}


def what_is_my_sign(day, month):
    for key in SIGNS.keys():
        if month == key[0] and day in key[1]:
            return SIGNS[key]
